// pages/city/city.js
const app = getApp();
Page({
  data: {
    search: '',
    searchList: {},
    CityList: [
      '北京', '上海', '广州', '深圳',
      '杭州', '天津', '成都', '南京',
      '西安', '武汉', '重庆', '兰州',
      '拉萨', '长沙'
    ],
    CityList2: [{
      province: '安徽',
      list: ['合肥', '芜湖', '马鞍山', '安庆', '亳州', '蚌埠', '滁州', '巢湖', '池州', '淮北', '淮南', '黄山', '铜陵', '阜阳', '宿州', '宣城', '六安']
    }, {
      province: '福建',
      list: ['厦门', '泉州', '福州', '龙岩', '南平', '莆田', '三明', '漳州', '宁德']
    }, {
      province: '广东',
      list: ['东莞', '中山', '云浮', '佛山', '广州', '惠州', '揭阳', '梅州', '汕头', '汕尾', '江门', '河源', '深圳', '清远', '湛江', '潮州', '珠海', '肇庆', '茂名', '阳江', '韶关']
    }, {
      province: '甘肃',
      list: ['兰州', '嘉峪关', '金昌', '白银', '天水', '庆阳', '平凉', '陇南', '定西', '武威', '张掖', '酒泉', '临夏州', '甘南州']
    }, {
      province: '广西',
      list: ['北海', '南宁', '柳州', '桂林', '崇左', '来宾', '河池', '贺州', '百色', '钦州', '贵港', '防城港', '梧州', '玉林']
    }, {
      province: '贵州',
      list: ['贵阳', '遵义', '黔东南州', '黔南州', '黔西南州', '毕节', '铜仁', '安顺', '六盘水']
    }, {
      province: '海南',
      list: ['三亚', '海口']
    }, {
      province: '河南',
      list: ['三门峡', '安阳', '平顶山', '开封', '洛阳', '焦作', '郑州', '鹤壁', '漯河', '南阳', '濮阳', '商丘', '新乡', '许昌', '信阳', '周口', '驻马店', '济源', '巩义', '兰考县', '汝州', '滑县', '长垣县', '邓州', '固始县', '鹿邑县', '新蔡县']
    }, {
      province: '河北',
      list: ['保定', '唐山', '廊坊', '张家口', '承德', '沧州', '石家庄', '秦皇岛', '衡水', '邢台', '邯郸']
    }, {
      province: '黑龙江',
      list: ['哈尔滨', '大庆', '牡丹江', '齐齐哈尔', '鸡西', '鹤岗', '双鸭山', '佳木斯', '七台河', '黑河', '绥化', '大兴安岭', '伊春']
    }, {
      province: '湖北',
      list: ['宜昌', '武汉', '荆州', '黄冈', '随州', '襄阳', '荆门', '仙桃', '潜江', '黄石', '十堰', '鄂州', '孝感', '咸宁', '襄樊', '恩施州']
    }, {
      province: '湖南',
      list: ['岳阳', '常德', '张家界', '株洲', '湘潭', '长沙', '湘西州', '娄底', '怀化', '永州', '郴州', '益阳', '邵阳', '衡阳']
    }, {
      province: '江西',
      list: ['九江', '南昌', '抚州', '赣州', '吉安', '景德镇', '萍乡', '上饶', '新余', '宜春', '鹰潭']
    }, {
      province: '江苏',
      list: ['南京', '南通', '句容', '吴江', '太仓', '宜兴', '宿迁', '常州', '常熟', '张家港', '徐州', '扬州', '无锡', '昆山', '江阴', '泰州', '海门', '淮安', '溧阳', '盐城', '苏州', '连云港', '金坛', '镇江']
    }, {
      province: '吉林',
      list: ['吉林', '长春', '松原', '辽源', '四平', '白山', '白城', '延边州', '通化']
    }, {
      province: '辽宁',
      list: ['丹东', '大连', '抚顺', '本溪', '沈阳', '瓦房店', '盘锦', '营口', '葫芦岛', '锦州', '鞍山', '朝阳', '阜新', '辽阳', '铁岭']
    }, {
      province: '内蒙古',
      list: ['包头', '呼和浩特', '赤峰', '鄂尔多斯', '巴彦淖尔', '二连浩特', '呼伦贝尔', '通辽', '乌海', '乌兰察布', '乌兰浩特', '锡林浩特', '巴彦浩特', '满洲里', '阿拉善盟', '兴安盟', '锡林郭勒盟']
    }, {
      province: '宁夏',
      list: ['石嘴山', '银川', '中卫', '吴忠', '固原']
    }, {
      province: '青海',
      list: ['西宁', '海南州', '黄南州', '海北州', '海东', '果洛州', '玉树州', '海西州']
    }, {
      province: '上海',
      list: ['上海']
    }, {
      province: '山东',
      list: ['东营', '临沂', '乳山', '即墨', '威海', '寿光', '平度', '德州', '招远', '文登', '日照', '枣庄', '泰安', '济南', '济宁', '淄博', '滨州', '潍坊', '烟台', '章丘', '聊城', '胶南', '胶州', '荣成', '莱州', '莱芜', '莱西', '菏泽', '蓬莱', '青岛']
    }, {
      province: '山西',
      list: ['临汾', '大同', '太原', '长治', '阳泉', '晋城', '晋中', '吕梁', '朔州', '忻州', '运城']
    }, {
      province: '四川',
      list: ['南充', '宜宾', '德阳', '成都', '攀枝花', '泸州', '绵阳', '自贡', '巴中', '达州', '广安', '广元', '内江', '遂宁', '乐山', '雅安', '资阳', '都江堰', '马尔康', '阆中', '峨眉山', '眉山', '西昌', '康定', '江油', '凉山州', '甘孜州', '阿坝州']
    }, {
      province: '陕西',
      list: ['咸阳', '宝鸡', '延安', '渭南', '西安', '铜川', '汉中', '榆林', '安康', '商洛']
    }, {
      province: '新疆',
      list: ['乌鲁木齐', '克拉玛依', '库尔勒', '和田', '伊宁', '吐鲁番', '阿图什', '石河子', '哈密', '奎屯', '阜康', '五家渠', '乌苏', '北屯', '博州', '阿勒泰', '塔城', '伊犁哈萨克州', '喀什', '克孜勒苏州', '阿克苏', '昌吉州', '博乐']
    }, {
      province: '西藏',
      list: ['拉萨', '昌都', '那曲', '山南', '林芝', '阿里', '日喀则']
    }, {
      province: '云南',
      list: ['昆明', '曲靖', '玉溪', '保山', '楚雄州', '大理州', '丽江', '临沧', '昭通', '文山州', '蒙自', '景洪', '潞西', '六库', '香格里拉', '迪庆州', '怒江州', '德宏州', '西双版纳州', '红河州', '思茅']
    }, {
      province: '浙江',
      list: ['临安', '丽水', '义乌', '台州', '嘉兴', '宁波', '富阳', '杭州', '温州', '湖州', '绍兴', '舟山', '衢州', '诸暨', '金华']
    }],
  },
  onLoad() {},
  watchPassWord: function(event) {
    const list = this.data.CityList2
    let res = []
    let name = event.detail.value
    // console.log(event.detail.value)
    this.setData({
      search: name
    })
    for (let item in list) {
      for (let item2 in list[item].list) {
        let index = list[item].list[item2].search(name)
        if (index != -1) {
          res.push(list[item].list[item2])
        }
      }
    }
    this.setData({
      searchList: res
    })
  },
  jump(event) {
    let name = event.target.dataset.city
    console.log(name)
    app.globalData.city = name
    wx.navigateBack()
  }
})